<section id="about">
    <div class="biography">
        <h3>Обо мне</h3>
        <div class="bio-wrapper">
            <div class="description">
                <p class="text-mobile">
                    Привет, я Fullstack-разработчик из Ростова-на-Дону с 4-х летним опытом
                    коммерческой разработки веб-приложений на PHP и JS.
                </p>
                <p class="text-mobile">
                    Мой основной стек - Laravel для построения серверной части
                    и Vue.js для разработки пользовательских интерфейсов.
                </p>
                <p class="text-mobile">
                    Имею хорошее понимание принципов ООП и структур данных, опыт проектирования и разработки
                    REST API, навыки работы с GitHub и Docker.
                </p>
                <p class="text-mobile m-0">
                    Активно расширяю свою технологическую базу, изучая новые фреймворки и инструменты,
                    такие как Symfony.
                </p>
            </div>
            <div class="short text-mobile">
                <div><span class="marker">Имя:</span> Владимир Дубинин</div>
                <div><span class="marker">Специальность:</span> Fullstack</div>
                <div><span class="marker">Основной стек:</span> Laravel & Vue.js</div>
                <div><span class="marker">Стаж работы:</span> 4 года</div>
                <div><span class="marker">Страна:</span> Россия</div>
                <div><span class="marker">Город:</span> Ростов-на-Дону</div>
            </div>
        </div>
    </div>
    <div class="experience">
        <h5>Образование и опыт работы</h5>
        <div class="stage">
            <div class="item">
                <div class="item-info">
                    <h6>РГСУ</h6>
                    <p><b>Бакалавриат</b></p>
                    <p>Факультет «Информационно-экономические системы»</p>
                    <p>09.04.02 «Информационные системы и технологии»</p>
                </div>
                <div class="item-time">
                    <div class="years">2015 - 2019</div>
                </div>
            </div>
            <div class="item">
                <div class="item-info">
                    <h6>ДГТУ</h6>
                    <p><b>Магистратура</b></p>
                    <p>Институт информационных систем и технологий</p>
                </div>
                <div class="item-time">
                    <div class="years">2019 - 2021</div>
                </div>
            </div>
            <div class="item">
                <div class="item-info">
                    <h6>IT-Enterprise</h6>
                    <p><b>Fullstack-разработчик</b></p>
                    <p>Основной стек: Laravel, Vue.js, Bitrix.</p>
                </div>
                <div class="item-time">
                    <div class="years">07.2021 - 12.2025</div>
                </div>
            </div>
        </div>
    </div>
    <div class="dop-info">
        <div class="hard-skills">
            <h5>Hard Skills</h5>
            <p class="text-mobile">Основные компетенции:</p>
            <ul class="ul-mobile m-0">
                <li>
                    <span class="icon">
                        <svg class="icon-24" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640">
                            <path fill="#ffffff"
                                  d="M320 168.5C491.4 168.5 623.2 240.7 623.2 320C623.2 399.3 491.3 471.5 320 471.5C148.6 471.5 16.8 399.3 16.8 320C16.8 240.7 148.7 168.5 320 168.5zM320 151.7C143.3 151.7 0 227 0 320C0 413 143.3 488.3 320 488.3C496.7 488.3 640 413 640 320C640 227 496.7 151.7 320 151.7zM218.2 306.5C210.3 347 182.4 342.8 148.1 342.8L161.8 272.2C199.8 272.2 225.6 268.1 218.2 306.5zM97.4 414.3L134.1 414.3L142.8 369.5C183.9 369.5 209.4 372.5 233 350.4C259.1 326.4 265.9 283.7 247.3 262.3C237.6 251.1 222 245.6 200.8 245.6L130.1 245.6L97.4 414.3zM283.1 200.7L319.6 200.7L310.9 245.5C342.4 245.5 371.6 243.2 385.7 256.2C400.5 269.8 393.4 287.2 377.4 369.3L340.4 369.3C355.8 289.9 358.7 283.3 353.1 277.3C347.7 271.5 335.4 272.7 305.7 272.7L286.9 369.3L250.4 369.3L283.1 200.7zM505 306.5C497 347.6 468.3 342.8 434.9 342.8L448.6 272.2C486.8 272.2 512.4 268.1 505 306.5zM384.2 414.3L421 414.3L429.7 369.5C472.9 369.5 496.8 372 519.9 350.4C546 326.4 552.8 283.7 534.2 262.3C524.5 251.1 508.9 245.6 487.7 245.6L417 245.6L384.2 414.3z"/>
                        </svg>
                    </span>
                    <b>PHP</b>
                </li>
                <li>
                    <span class="icon">
                        <svg class="icon-24" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640">
                            <path fill="currentColor"
                                  d="M568.6 179.8C568.5 179.6 568.4 179.3 568.3 179.1C568.2 178.7 568 178.3 567.8 177.9C567.6 177.7 567.5 177.4 567.3 177.2C567.1 176.9 566.8 176.6 566.6 176.3C566.4 176.1 566.1 175.9 565.8 175.7C565.5 175.5 565.2 175.2 564.9 175L468.6 119.5C467.4 118.8 466 118.4 464.6 118.4C463.2 118.4 461.8 118.8 460.6 119.5L364.3 175C364 175.2 363.7 175.4 363.4 175.7C363.1 175.9 362.9 176.1 362.6 176.3C362.3 176.6 362.1 176.9 361.9 177.2C361.7 177.4 361.5 177.6 361.4 177.9C361.2 178.3 361 178.7 360.9 179.1C360.8 179.3 360.7 179.5 360.6 179.8C360.4 180.5 360.3 181.2 360.3 181.9L360.3 287.1L280.1 333.3L280.1 127.4C280.1 126.7 280 126 279.8 125.3C279.7 125.1 279.6 124.9 279.5 124.6C279.4 124.2 279.2 123.8 279 123.4C278.9 123.1 278.6 122.9 278.5 122.7C278.3 122.4 278 122.1 277.8 121.8C277.6 121.6 277.3 121.4 277 121.2C276.7 121 276.4 120.7 276.1 120.5L179.8 65.1C178.6 64.4 177.2 64 175.8 64C174.4 64 173 64.4 171.8 65.1L75.5 120.5C75.2 120.7 74.9 120.9 74.6 121.2C74.3 121.4 74.1 121.6 73.8 121.8C73.5 122.1 73.3 122.4 73.1 122.7C72.9 123 72.7 123.2 72.5 123.4C72.3 123.8 72.1 124.2 72 124.6C71.9 124.8 71.8 125 71.7 125.3C71.5 126 71.4 126.7 71.4 127.4L71.4 457.1C71.4 458.5 71.8 459.9 72.5 461.1C73.2 462.3 74.2 463.3 75.4 464L268 574.9C268.4 575.1 268.9 575.3 269.3 575.4C269.5 575.5 269.7 575.6 269.9 575.7C271.2 576.1 272.7 576.1 274 575.7C274.2 575.6 274.4 575.5 274.6 575.5C275.1 575.3 275.6 575.2 276 574.9L468.6 464.1C469.8 463.4 470.8 462.4 471.5 461.2C472.2 460 472.6 458.6 472.6 457.2L472.6 351.9L564.8 298.8C566 298.1 567 297.1 567.7 295.8C568.4 294.5 568.8 293.2 568.8 291.8L568.8 182C568.8 181.3 568.7 180.6 568.6 179.9zM175.8 81.3L256 127.4L175.8 173.6L95.6 127.4L175.8 81.2zM264 141.3L264 342.6C230.8 361.7 204.1 377.1 183.8 388.8L183.8 187.5C217 168.4 243.7 153 264 141.3zM264 554.1L87.5 452.5L87.5 141.3C107.8 153 134.6 168.4 167.7 187.5L167.7 402.7C167.7 403 167.8 403.3 167.8 403.6C167.8 404 167.9 404.4 168 404.8C168.1 405.1 168.2 405.4 168.4 405.7C168.5 406 168.7 406.4 168.8 406.7C169 407 169.2 407.2 169.4 407.5C169.6 407.8 169.8 408.1 170.1 408.3C170.3 408.5 170.6 408.7 170.9 408.9C171.2 409.1 171.5 409.4 171.8 409.6L264 461.8L264.1 554.2zM272 447.9L192 402.6C246.7 371.1 305.5 337.3 368.3 301.1L448.4 347.2C419 364 360.2 397.5 272 447.9zM456.5 452.5L280 554.1L280 461.8C381.4 404 440.2 370.4 456.5 361L456.5 452.4zM456.5 333.4C436.2 321.8 409.4 306.4 376.3 287.3L376.3 195.9C396.6 207.6 423.4 223 456.5 242.1L456.5 333.4zM464.5 228.1L384.3 181.9L464.5 135.7L544.7 181.8L464.5 228zM472.5 333.4L472.5 242.1C505.7 223 532.5 207.6 552.8 195.9L552.8 287.3L472.5 333.5z"/></svg>
                    </span>
                    <b>Laravel</b>
                </li>
                <li>
                    <span class="icon">
                        <svg class="icon-24" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640">
                            <path fill="#FFD43B"
                                  d="M544 160C544 124.7 515.3 96 480 96L160 96C124.7 96 96 124.7 96 160L96 480C96 515.3 124.7 544 160 544L480 544C515.3 544 544 515.3 544 480L544 160zM276.9 508.9C243.2 508.9 223.7 491.5 213.7 470.4L248 449.7C254.6 461.4 260.6 471.3 275.1 471.3C288.9 471.3 297.7 465.9 297.7 444.8L297.7 301.7L339.8 301.7L339.8 445.4C339.8 489 314.2 508.9 276.9 508.9zM362.7 465.9L397 446.1C406 460.8 417.8 471.7 438.5 471.7C455.9 471.7 467.1 463 467.1 450.9C467.1 436.5 455.7 431.4 436.4 422.9L425.9 418.4C395.5 405.5 375.4 389.2 375.4 354.9C375.4 323.3 399.5 299.3 437 299.3C463.8 299.3 483 308.6 496.8 333L464 354C456.8 341.1 449 336 436.9 336C424.6 336 416.8 343.8 416.8 354C416.8 366.6 424.6 371.7 442.7 379.6L453.2 384.1C489 399.4 509.1 415.1 509.1 450.3C509.1 488.1 479.3 508.9 439.4 508.9C400.3 508.9 375 490.3 362.7 465.9z"/>
                        </svg>
                    </span>
                    <b>JavaScript</b>
                </li>
                <li>
                    <span class="icon">
                        <svg class="icon-24" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640">
                            <path fill="#63E6BE"
                                  d="M452.9 128.3L376 128.3L320 216.9L272 128.3L96 128.3L320 512L544 128.3L452.9 128.3zM151.7 160.3L205.5 160.3L320 358.5L434.4 160.3L488.2 160.3L320 448.5L151.7 160.3z"/></svg>
                    </span>
                    <b>Vue.js</b>
                </li>
                <li>
                    <span class="icon">
                        <svg class="icon-24" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640">
                            <path fill="currentColor"
                                  d="M544 269.8C529.2 279.6 512.2 287.5 494.5 293.8C447.5 310.6 385.8 320 320 320C254.2 320 192.4 310.5 145.5 293.8C127.9 287.5 110.8 279.6 96 269.8L96 352C96 396.2 196.3 432 320 432C443.7 432 544 396.2 544 352L544 269.8zM544 192L544 144C544 99.8 443.7 64 320 64C196.3 64 96 99.8 96 144L96 192C96 236.2 196.3 272 320 272C443.7 272 544 236.2 544 192zM494.5 453.8C447.6 470.5 385.9 480 320 480C254.1 480 192.4 470.5 145.5 453.8C127.9 447.5 110.8 439.6 96 429.8L96 496C96 540.2 196.3 576 320 576C443.7 576 544 540.2 544 496L544 429.8C529.2 439.6 512.2 447.5 494.5 453.8z"/>
                        </svg>
                    </span>
                    <b>MySQL</b>
                </li>
                <li>
                    <span class="icon">
                        <svg class="icon-24" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640">
                            <path fill="#FF8000"
                                  d="M128 96L162.9 491.8L319.5 544L477.1 491.8L512 96L128 96zM436.2 223.9L252.4 223.9L256.5 273.3L432.1 273.3L418.5 421.7L320.6 448.7L320.6 449L319.5 449L220.8 421.7L214.8 345.9L262.5 345.9L266 384L319.5 398.5L373.2 384L379.2 321.8L212.3 321.8L199.5 176.2L440.6 176.2L436.2 223.9z"/></svg>
                    </span>
                    <b>HTML</b>
                </li>
                <li>
                    <span class="icon">
                        <svg class="icon-24" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640">
                            <path fill="#74C0FC"
                                  d="M128 96L162.9 491.8L320 544L477.1 491.8L512 96L128 96zM441.1 176L436.3 223.3L321 272.6L320.7 272.7L432.2 272.7L419.4 419.3L321.2 448L222.4 418.8L216 344.9L264.9 344.9L268.1 383.2L320.7 396.5L375.4 381.1L379.1 319.5L212.8 319L212.8 318.9L212.6 319L209 272.7L321.1 226L327.6 223.3L204.7 223.3L198.9 176L441.1 176z"/></svg>
                    </span>
                    <b>CSS</b>
                </li>
            </ul>
        </div>
        <div class="soft-skills">
            <h5>Soft Skills</h5>
            <p class="text-mobile">Ключевые Soft Skills, характеризующие мой подход к работе:</p>
            <ul class="ul-mobile m-0">
                <li><b>Ответственность</b></li>
                <li><b>Обучаемость</b></li>
                <li><b>Стрессоустойчивость</b></li>
                <li><b>Находчивость</b></li>
                <li><b>Самоорганизация</b></li>
                <li><b>Коммуникабельность</b></li>
            </ul>
        </div>
    </div>
</section>
